sorosaulong-ux/gd32-test-project/Library/gd32a7xx_gpio.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0002U), ERR_PERIPH);
    }else if(NOT_GPIO_MODE(mode)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0002U), ERR_PARAM_OUT_OF_RANGE);
    }else if(NOT_GPIO_PULL_MODE(pull_up_down)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0002U), ERR_PARAM_OUT_OF_RANGE);
    }else if(NOT_GPIO_PIN(pin)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0002U), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ctl = GPIO_CTL(gpio_periph);
        pupd = GPIO_PUD(gpio_periph);

        for(i = 0U; i < 16U; i++) {
            if(0U != ((((uint32_t)1U << i)) & pin)) {
                /* clear the specified pin mode bits */
                ctl &= ~GPIO_MODE_MASK(i);
                /* set the specified pin mode bits */
                ctl |= GPIO_MODE_SET(i, mode);

                /* clear the specified pin pupd bits */
                pupd &= ~GPIO_PUPD_MASK(i);
                /* set the specified pin pupd bits */
                pupd |= GPIO_PUPD_SET(i, pull_up_down);
            }
        }

        GPIO_CTL(gpio_periph) = ctl;
        GPIO_PUD(gpio_periph) = pupd;
    }
}

/*!
    \brief      set GPIO output type and speed (API_ID: 0x0003U)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[in]  otype: gpio pin output mode
                only one parameter can be selected which is shown as below:
      \arg        GPIO_OTYPE_PP: push pull mode
      \arg        GPIO_OTYPE_OD: open drain mode
    \param[in]  speed: gpio pin output max speed
                only one parameter can be selected which is shown as below:
      \arg        GPIO_OSPEED_LEVEL_0: output speed level 0
      \arg        GPIO_OSPEED_LEVEL_1: output speed level 1
      \arg        GPIO_OSPEED_LEVEL_2: output speed level 2
    \param[in]  pin: GPIO pin
                one or more parameters can be selected which are shown as below:
      \arg        GPIO_PIN_x(x=0..15), GPIO_PIN_ALL
    \param[out] none
    \retval     none
*/
void gpio_output_options_set(uint32_t gpio_periph, uint8_t otype, uint32_t speed, uint32_t pin)
{
    uint16_t i;
    uint32_t ospeed;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0003U), ERR_PERIPH);
    }else if(NOT_GPIO_OTYPE(otype)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0003U), ERR_PARAM_OUT_OF_RANGE);
    }else if(NOT_GPIO_SPEED(speed)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0003U), ERR_PARAM_OUT_OF_RANGE);
    }else if(NOT_GPIO_PIN(pin)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0003U), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */

    {
        if(GPIO_OTYPE_OD == otype) {
            GPIO_OMODE(gpio_periph) |= (uint32_t)pin;
        }else {
            GPIO_OMODE(gpio_periph) &= (uint32_t)(~pin);
        }

        /* get the specified pin output speed bits value */
        ospeed = GPIO_OSPD(gpio_periph);

        for(i = 0U; i < 16U; i++) {
            if(0U != (((uint32_t)1U << i) & pin)) {
                /* clear the specified pin output speed bits */
                ospeed &= ~GPIO_OSPEED_MASK(i);
                /* set the specified pin output speed bits */
                ospeed |= GPIO_OSPEED_SET(i, speed);
            }
        }
        GPIO_OSPD(gpio_periph) = ospeed;
    }
}

/*!
    \brief      set GPIO pin bit (API_ID: 0x0004U)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[in]  pin: GPIO pin
                one or more parameters can be selected which are shown as below:
      \arg        GPIO_PIN_x(x=0..15), GPIO_PIN_ALL
    \param[out] none
    \retval     none
*/
void gpio_bit_set(uint32_t gpio_periph, uint32_t pin)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0004U), ERR_PERIPH);
    }else if(NOT_GPIO_PIN(pin)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0004U), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        GPIO_BOP(gpio_periph) = (uint32_t)pin;
    }
}

/*!
    \brief      reset GPIO pin bit (API_ID: 0x0005U)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[in]  pin: GPIO pin
                one or more parameters can be selected which are shown as below:
      \arg        GPIO_PIN_x(x=0..15), GPIO_PIN_ALL
    \param[out] none
    \retval     none
*/
void gpio_bit_reset(uint32_t gpio_periph, uint32_t pin)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0005U), ERR_PERIPH);
    }else if(NOT_GPIO_PIN(pin)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0005U), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        GPIO_BC(gpio_periph) = (uint32_t)pin;
    }
}

/*!
    \brief      write data to the specified GPIO pin (API_ID: 0x0006U)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[in]  pin: GPIO pin
                one or more parameters can be selected which are shown as below:
      \arg        GPIO_PIN_x(x=0..15), GPIO_PIN_ALL
    \param[in]  bit_value: SET or RESET
                only one parameter can be selected which is shown as below:
      \arg        RESET: clear the port pin
      \arg        SET: set the port pin
    \param[out] none
    \retval     none
*/
void gpio_bit_write(uint32_t gpio_periph, uint32_t pin, bit_status bit_value)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0006U), ERR_PERIPH);
    }else if(NOT_GPIO_PIN(pin)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0006U), ERR_PARAM_OUT_OF_RANGE);
    }else if(NOT_RESET_SET(bit_value)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0006U), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(RESET != bit_value) {
            GPIO_BOP(gpio_periph) = (uint32_t)pin;
        }else {
            GPIO_BOP(gpio_periph) = (uint32_t)(pin << 16U);
        }
    }
}

/*!
    \brief      write data to the specified GPIO port (API_ID: 0x0007U)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[in]  data: specify the value to be written to the port output control register
    \param[out] none
    \retval     none
*/
void gpio_port_write(uint32_t gpio_periph, uint16_t data)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0007U), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        GPIO_OCTL(gpio_periph) = (uint32_t)data;
    }
}

/*!
    \brief      get GPIO pin input status (API_ID: 0x0008U)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[in]  pin: GPIO pin
                one or more parameters can be selected which are shown as below:
      \arg        GPIO_PIN_x(x=0..15), GPIO_PIN_ALL
    \param[out] none
    \retval     SET or RESET
*/
FlagStatus gpio_input_bit_get(uint32_t gpio_periph, uint32_t pin)
{
    FlagStatus reval = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0008U), ERR_PERIPH);
    }else if(NOT_GPIO_PIN(pin)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0008U), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if((uint32_t)RESET != (GPIO_ISTAT(gpio_periph) & (pin))) {
            reval = SET;
         }else {
            reval = RESET;
        }
    }
    return reval;
}

/*!
    \brief      get GPIO port input status (API_ID: 0x0009U)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[out] none
    \retval     state of GPIO all pins
*/
uint16_t gpio_input_port_get(uint32_t gpio_periph)
{
    uint16_t reval = 0;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0009U), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reval = ((uint16_t)GPIO_ISTAT(gpio_periph));
    }
    return reval;
}

/*!
    \brief      get GPIO pin output status (API_ID: 0x000AU)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[in]  pin: GPIO pin
                one or more parameters can be selected which are shown as below:
      \arg        GPIO_PIN_x(x=0..15), GPIO_PIN_ALL
    \param[out] none
    \retval     SET or RESET
*/
FlagStatus gpio_output_bit_get(uint32_t gpio_periph, uint32_t pin)
{
    FlagStatus reval = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x000AU), ERR_PERIPH);
    }else if(NOT_GPIO_PIN(pin)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x000AU), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if((uint32_t)RESET != (GPIO_OCTL(gpio_periph) & (pin))) {
            reval = SET;
        }else {
            reval = RESET;
        }
    }
    return reval;
}

/*!
    \brief      get GPIO port output status (API_ID: 0x000BU)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[out] none
    \retval     state of GPIO all pins
*/
uint16_t gpio_output_port_get(uint32_t gpio_periph)
{
    uint16_t reval = 0;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x000BU), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reval = ((uint16_t)GPIO_OCTL(gpio_periph));
    }
    return reval;
}

/*!
    \brief      set GPIO alternate function (API_ID: 0x000CU)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[in]  alt_func_num: GPIO pin af function, please refer to specific device datasheet
                only one parameter can be selected which is shown as below:
      \arg        GPIO_AF_x(x = 0..15)
    \param[in]  pin: GPIO pin
                one or more parameters can be selected which are shown as below:
      \arg        GPIO_PIN_x(x=0..15), GPIO_PIN_ALL
    \param[out] none
    \retval     none
*/
void gpio_af_set(uint32_t gpio_periph, uint32_t alt_func_num, uint32_t pin)
{
    uint16_t i;
    uint32_t afrl, afrh;
    
