sorosaulong-ux/gd32-test-project/Library/gd32a7xx_gpio.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x000CU), ERR_PERIPH);
    }else if(NOT_GPIO_AF(alt_func_num)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x000CU), ERR_PARAM_OUT_OF_RANGE);
    }else if(NOT_GPIO_PIN(pin)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x000CU), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        afrl = GPIO_AFSEL0(gpio_periph);
        afrh = GPIO_AFSEL1(gpio_periph);

        for(i = 0U; i < 8U; i++) {
            if( 0U != (((uint32_t)1U << i) & pin)) {
                /* clear the specified pin alternate function bits */
                afrl &= ~GPIO_AFR_MASK(i);
                afrl |= GPIO_AFR_SET(i, alt_func_num);
            }
        }

        for(i = 8U; i < 16U; i++) {
            if (0U != (((uint32_t)1U << i) & pin)) {
                /* clear the specified pin alternate function bits */
                afrh &= ~GPIO_AFR_MASK(i - 8U);
                afrh |= GPIO_AFR_SET(i - 8U, alt_func_num);
            }
        }

        GPIO_AFSEL0(gpio_periph) = afrl;
        GPIO_AFSEL1(gpio_periph) = afrh;
    }
}

/*!
    \brief      lock GPIO pin bit (API_ID: 0x000DU)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[in]  pin: GPIO pin
                one or more parameters can be selected which are shown as below:
      \arg        GPIO_PIN_x(x=0..15), GPIO_PIN_ALL
    \param[out] none
    \retval     none
*/
void gpio_pin_lock(uint32_t gpio_periph, uint32_t pin)
{
    uint32_t lock = 0x00010000U;
    lock |= pin;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x000DU), ERR_PERIPH);
    }else if(NOT_GPIO_PIN(pin)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x000DU), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* lock key writing sequence: write 1->write 0->write 1->read 0->read 1 */
        GPIO_LOCK(gpio_periph) = (uint32_t)lock;
        GPIO_LOCK(gpio_periph) = (uint32_t)pin;
        GPIO_LOCK(gpio_periph) = (uint32_t)lock;
        GPIO_LOCK(gpio_periph);
        GPIO_LOCK(gpio_periph);
    }
}

/*!
    \brief      toggle GPIO pin status (API_ID: 0x000EU)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[in]  pin: GPIO pin
                one or more parameters can be selected which are shown as below:
      \arg        GPIO_PIN_x(x=0..15), GPIO_PIN_ALL
    \param[out] none
    \retval     none
*/
void gpio_bit_toggle(uint32_t gpio_periph, uint32_t pin)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x000EU), ERR_PERIPH);
    }else if(NOT_GPIO_PIN(pin)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x000EU), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        GPIO_TG(gpio_periph) = (uint32_t)pin;
    }
}

/*!
    \brief      toggle GPIO port status (API_ID: 0x000FU)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[out] none
    \retval     none
*/
void gpio_port_toggle(uint32_t gpio_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x000FU), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        GPIO_TG(gpio_periph) = 0x0000FFFFU;
    }
}

/*!
    \brief      enable GPIO pin safe mode (API_ID: 0x0010U)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[in]  pin: GPIO pin
                one or more parameters can be selected which are shown as below:
      \arg        GPIO_PIN_x(x=0..15), GPIO_PIN_ALL
    \param[out] none
    \retval     none
*/
void gpio_safe_mode_enable(uint32_t gpio_periph, uint32_t pin)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0010U), ERR_PERIPH);
    }else if(NOT_GPIO_PIN(pin)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0010U), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        GPIO_SMCCTL(gpio_periph) |= (uint32_t)pin;
    }
}

/*!
    \brief      disable GPIO pin safe mode (API_ID: 0x0011U)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[in]  pin: GPIO pin
                one or more parameters can be selected which are shown as below:
      \arg        GPIO_PIN_x(x=0..15), GPIO_PIN_ALL
    \param[out] none
    \retval     none
*/
void gpio_safe_mode_disable(uint32_t gpio_periph, uint32_t pin)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0011U), ERR_PERIPH);
    }else if(NOT_GPIO_PIN(pin)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0011U), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        GPIO_SMCCTL(gpio_periph) &= (uint32_t)(~pin);
    }
}

/*!
    \brief      enable GPIO pin input filter (API_ID: 0x0012U)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[in]  pin: GPIO pin
                one or more parameters can be selected which are shown as below:
      \arg        GPIO_PIN_x(x=0..15), GPIO_PIN_ALL
    \param[out] none
    \retval     none
*/
void gpio_port_filter_enable(uint32_t gpio_periph, uint32_t pin)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0012U), ERR_PERIPH);
    }else if(NOT_GPIO_PIN(pin)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0012U), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        GPIO_IFEN(gpio_periph) |= (uint32_t)pin;
    }
}

/*!
    \brief      disable GPIO pin input filter (API_ID: 0x0013U)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[in]  pin: GPIO pin
                one or more parameters can be selected which are shown as below:
      \arg        GPIO_PIN_x(x=0..15), GPIO_PIN_ALL
    \param[out] none
    \retval     none
*/
void gpio_port_filter_disable(uint32_t gpio_periph, uint32_t pin)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0013U), ERR_PERIPH);
    }else if(NOT_GPIO_PIN(pin)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0013U), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        GPIO_IFEN(gpio_periph) &= (uint32_t)(~pin);
    }
}

/*!
    \brief      enable GPIO pin pad retaining (API_ID: 0x0014U)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[in]  pin: GPIO pin
                one or more parameters can be selected which are shown as below:
      \arg        GPIO_PIN_x(x=0..15), GPIO_PIN_ALL
    \param[out] none
    \retval     none
*/
void gpio_port_retain_enable(uint32_t gpio_periph, uint32_t pin)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0014U), ERR_PERIPH);
    }else if(NOT_GPIO_PIN(pin)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0014U), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        GPIO_PREN(gpio_periph) |= (uint32_t)pin;
    }
}

/*!
    \brief      disable GPIO pin pad retaining (API_ID: 0x0015U)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[in]  pin: GPIO pin
                one or more parameters can be selected which are shown as below:
      \arg        GPIO_PIN_x(x=0..15), GPIO_PIN_ALL
    \param[out] none
    \retval     none
*/
void gpio_port_retain_disable(uint32_t gpio_periph, uint32_t pin)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0015U), ERR_PERIPH);
    }else if(NOT_GPIO_PIN(pin)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0015U), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        GPIO_PREN(gpio_periph) &= (uint32_t)(~pin);
    }
}

/*!
    \brief      enable GPIO pin slew rate (API_ID: 0x0016U)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[in]  pin: GPIO pin
                one or more parameters can be selected which are shown as below:
      \arg        GPIO_PIN_x(x=0..15), GPIO_PIN_ALL
    \param[out] none
    \retval     none
*/
void gpio_slew_enable(uint32_t gpio_periph, uint32_t pin)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0016U), ERR_PERIPH);
    }else if(NOT_GPIO_PIN(pin)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0016U), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        GPIO_SREN(gpio_periph) |= (uint32_t)pin;
    }
}

/*!
    \brief      disable GPIO pin slew rate (API_ID: 0x0017U)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[in]  pin: GPIO pin
                one or more parameters can be selected which are shown as below:
      \arg        GPIO_PIN_x(x=0..15), GPIO_PIN_ALL
    \param[out] none
    \retval     none
*/
void gpio_slew_disable(uint32_t gpio_periph, uint32_t pin)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0017U), ERR_PERIPH);
    }else if(NOT_GPIO_PIN(pin)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0017U), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        GPIO_SREN(gpio_periph) &= (uint32_t)(~pin);
    }
}

/*!
    \brief      enable GPIO pin digital glitch filter on the interrupt pad input (API_ID: 0x0018U)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[in]  pin: GPIO pin
                one or more parameters can be selected which are shown as below:
      \arg        GPIO_PIN_x(x=0..15), GPIO_PIN_ALL
    \param[out] none
    \retval     none
*/
void gpio_int_filt_enable(uint32_t gpio_periph, uint32_t pin)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0018U), ERR_PERIPH);
    }else if(NOT_GPIO_PIN(pin)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0018U), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        GPIO_IFCTL(gpio_periph) |= (uint32_t)pin;
    }
}

/*!
    \brief      disable GPIO pin digital glitch filter on the interrupt pad input (API_ID: 0x0019U)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[in]  pin: GPIO pin
                one or more parameters can be selected which are shown as below:
      \arg        GPIO_PIN_x(x=0..15), GPIO_PIN_ALL
    \param[out] none
    \retval     none
*/
void gpio_int_filt_disable(uint32_t gpio_periph, uint32_t pin)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0019U), ERR_PERIPH);
    }else if(NOT_GPIO_PIN(pin)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0019U), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        GPIO_IFCTL(gpio_periph) &= (uint32_t)(~pin);
    }
}

/*!
    \brief      set GPIO port external interrupt qualification sampling period (API_ID: 0x001AU)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[in]  sampling_period: sampling period, 0 - 15
    \param[out] none
    \retval     none
*/
void gpio_int_filt_sampling_period_set(uint32_t gpio_periph, uint8_t sampling_period)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x001AU), ERR_PERIPH);
    }else if(NOT_SAMPLING_PERIOD(sampling_period)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x001AU), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        GPIO_IFCTL(gpio_periph) &= (uint32_t)(~GPIO_IFCTL_IQSP);
        GPIO_IFCTL(gpio_periph) |= (uint32_t)((uint32_t)sampling_period << (32U - 4U));
    }
}

/*!
    \brief      set GPIO pin external interrupt filter counter (API_ID: 0x001BU)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[in]  pin: GPIO pin
                one or more parameters can be selected which are shown as below:
      \arg        GPIO_PIN_x(x=0..15), GPIO_PIN_ALL
    \param[in]  counter: sampling period, 0 - 15

    \param[out] none
    \retval     none
*/
void gpio_int_filt_sample_counter_set(uint32_t gpio_periph, uint32_t pin, uint8_t counter)
{
    uint16_t i;
    uint32_t ifc_splcntl, ifc_splcnth;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x001BU), ERR_PERIPH);
    }else if(NOT_GPIO_PIN(pin)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x001BU), ERR_PARAM_OUT_OF_RANGE);
    }else if(NOT_FLITER_COUNTER(counter)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x001BU), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ifc_splcntl = GPIO_IFSCCTL0(gpio_periph);
        ifc_splcnth = GPIO_IFSCCTL1(gpio_periph);

        for(i = 0U; i < 8U; i++) {
            if (0U != (((uint32_t)1U << i) & pin)) {
                ifc_splcntl &= ~GPIO_IFSCTL_SPLCNT_MASK(i);
                ifc_splcntl |= GPIO_IFSCTL_SPLCNT_SET(i, counter);
            }
        }

