sorosaulong-ux/gd32-test-project/Library/gd32a7xx_gpio.c
        for(i = 8U; i < 16U; i++) {
            if(0U != (((uint32_t)1U << i) & pin)) {
                ifc_splcnth &= ~GPIO_IFSCTL_SPLCNT_MASK(i - 8U);
                ifc_splcnth |= GPIO_IFSCTL_SPLCNT_SET(i - 8U, counter);
            }
        }

        GPIO_IFSCCTL0(gpio_periph) = ifc_splcntl;
        GPIO_IFSCCTL1(gpio_periph) = ifc_splcnth;
    }
}

/*!
    \brief      get GPIO TMR alarm status (API_ID: 0x001CU)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[in]  tmr_alarm: tmr alarm status
                only one parameter can be selected which is shown as below:
        \arg      GPIO_TMRASTAT_PXFFIO0
        \arg      GPIO_TMRASTAT_PXFFIO1
        \arg      GPIO_TMRASTAT_PXGFP
        \arg      GPIO_TMRASTAT_PXRESET
    \param[out] none
    \retval     SET or RESET
*/
FlagStatus gpio_tmr_alarm_status_get(uint32_t gpio_periph, uint32_t tmr_alarm)
{
    FlagStatus reval = RESET;
    uint32_t tmralm;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x001CU), ERR_PERIPH);
    }else if(NOT_TMRALARM_STATUS(tmr_alarm)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x001CU), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        tmralm = GPIO_TMRASTAT(gpio_periph);

        if((uint32_t)RESET != (tmralm & tmr_alarm)) {
            reval = SET;
        }else {
            reval = RESET;
        }
    }
    return reval;
}

/*!
    \brief      clear GPIO port TMR alarm status (API_ID: 0x001DU)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[in]  tmr_alarm: tmr alarm status
                only one parameter can be selected which is shown as below:
        \arg      GPIO_TMRASTAT_PXFFIO0
        \arg      GPIO_TMRASTAT_PXFFIO1
        \arg      GPIO_TMRASTAT_PXGFIO
        \arg      GPIO_TMRASTAT_PXRESET
    \param[out] none
    \retval     none
*/
void gpio_tmr_alarm_status_clear(uint32_t gpio_periph, uint32_t tmr_alarm)
{
    uint32_t tmralm;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x001DU), ERR_PERIPH);
    }else if(NOT_TMRALARM_STATUS(tmr_alarm)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x001DU), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        tmralm = GPIO_TMRASTAT(gpio_periph);
        tmralm |= tmr_alarm;
        GPIO_TMRASTAT(gpio_periph) = tmralm;
    }
}

/*!
    \brief      get GPIO port TMR alarm mask status (API_ID: 0x001EU)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[in]  tmr_alarm: tmr alarm mask
                only one parameter can be selected which is shown as below:
        \arg      GPIO_TMRASTAT_PXFFIO0MSK
        \arg      GPIO_TMRASTAT_PXFFIO1MSK
        \arg      GPIO_TMRASTAT_PXGFIOMSK
        \arg      GPIO_TMRASTAT_PXRESETMSK
    \param[out] none
    \retval     SET or RESET
*/
FlagStatus gpio_tmr_alarm_mask_status_get(uint32_t gpio_periph, uint32_t tmr_alarm)
{
    FlagStatus reval = RESET;
    uint32_t tmralm;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x001EU), ERR_PERIPH);
    }else if(NOT_TMRALARM_MASK(tmr_alarm)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x001EU), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        tmralm = GPIO_TMRASTAT(gpio_periph);
        if((uint32_t)RESET != (tmralm & tmr_alarm)) {
            reval = RESET;
        }else {
            reval = SET;
        }
    }
    return reval;
}

/*!
    \brief      enable mask GPIO port TMR alarm (API_ID: 0x001FU)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[in]  tmr_alarm: tmr alarm mask
                only one parameter can be selected which is shown as below:
        \arg      GPIO_TMRASTAT_PXFFIO0MSK
        \arg      GPIO_TMRASTAT_PXFFIO1MSK
        \arg      GPIO_TMRASTAT_PXGFIOMSK
        \arg      GPIO_TMRASTAT_PXRESETMSK
    \param[out] none
    \retval     none
*/
void gpio_tmr_alarm_mask_enable(uint32_t gpio_periph, uint32_t tmr_alarm)
{
    uint32_t tmralm;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x001FU), ERR_PERIPH);
    }else if(NOT_TMRALARM_MASK(tmr_alarm)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x001FU), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        tmralm = GPIO_TMRASTAT(gpio_periph);
        tmralm &= (0xFFFF0000U | GPIO_TMRASTAT_MASK_ALL);
        tmralm &= ~tmr_alarm;
        GPIO_TMRASTAT(gpio_periph) = tmralm;
    }
}

/*!
    \brief      disable mask GPIO port TMR alarm (API_ID: 0x0020U)
    \param[in]  gpio_periph: GPIOx(x = A,B,C..N)
                only one parameter can be selected which is shown as below:
      \arg        GPIOx(x = A,B,C..N)
    \param[in]  tmr_alarm: tmr alarm mask
                only one parameter can be selected which is shown as below:
        \arg      GPIO_TMRASTAT_PXFFIO0MSK
        \arg      GPIO_TMRASTAT_PXFFIO1MSK
        \arg      GPIO_TMRASTAT_PXGFIOMSK
        \arg      GPIO_TMRASTAT_PXRESETMSK
    \param[out] none
    \retval     none
*/
void gpio_tmr_alarm_mask_disable(uint32_t gpio_periph, uint32_t tmr_alarm)
{
    uint32_t tmralm;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_GPIO_PERIPH(gpio_periph)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0020U), ERR_PERIPH);
    }else if(NOT_TMRALARM_MASK(tmr_alarm)) {
        fw_debug_report_err(GPIO_MODULE_ID, API_ID(0x0020U), ERR_PARAM_OUT_OF_RANGE);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        tmralm = GPIO_TMRASTAT(gpio_periph);
        tmralm &= (0xFFFF0000U | GPIO_TMRASTAT_MASK_ALL);
        tmralm |= tmr_alarm;
        GPIO_TMRASTAT(gpio_periph) = tmralm;
    }
}
